DISEASE_KNOWLEDGE = {
    "Potato___Late_Blight": {
        "name": "Potato Late Blight",
        "hindi_name": "आलू का लेट ब्लाइट",
        "symptoms": [
            "पत्तियों पर भूरे-काले धब्बे",
            "नमी में रोग तेजी से फैलता है",
            "तना और आलू भी संक्रमित हो सकते हैं"
        ],
        "treatment": [
            "मैंकोजेब या मेटालेक्सिल का छिड़काव करें",
            "रोगग्रस्त पौधों को हटा दें",
            "खेत में पानी जमा न होने दें"
        ],
        "prevention": [
            "स्वस्थ बीज का उपयोग करें",
            "2–3 साल फसल चक्र अपनाएँ",
            "अत्यधिक सिंचाई से बचें"
        ]
    },

    "Tomato___Early_Blight": {
        "name": "Tomato Early Blight",
        "hindi_name": "टमाटर का अर्ली ब्लाइट",
        "symptoms": [
            "पत्तियों पर गोल भूरे धब्बे",
            "नीचे की पत्तियों से रोग शुरू होता है"
        ],
        "treatment": [
            "क्लोरोथैलोनिल या मैंकोजेब का छिड़काव",
            "संक्रमित पत्तियाँ हटाएँ"
        ],
        "prevention": [
            "बीज उपचार करें",
            "खेत में हवा का प्रवाह अच्छा रखें"
        ]
    },

    "Healthy": {
        "name": "Healthy Crop",
        "hindi_name": "स्वस्थ फसल",
        "symptoms": [
            "कोई रोग लक्षण नहीं"
        ],
        "treatment": [
            "कोई उपचार आवश्यक नहीं"
        ],
        "prevention": [
            "संतुलित खाद और पानी देते रहें"
        ]
    }
}
